rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'PG'  ORDER BY title
---
 def index

   @all_ratings = Movie.all_ratings
   @ratings_to_show = []
   #puts @ratings_to_show

   puts @params
   if session[:'ratings'] != nil and params[:'ratings'] == nil and params[:commit] == nil and session[:ratings].empty? != true
        params[:'ratings'] = session['ratings']; session[:ratings]={}
   end

    if session[:'sortVar'] != nil and params[:'sortVar'] == nil
        params[:'sortVar'] = session['sortVar']; session[:sortVar]={}

    end


   @sortVariable = params[:sortVar]

    if params[:'ratings'].nil? == true #ratings is empty, no more work needs to be done.
      @movies = Movie.all