rottenpotatoes/app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" = 'PG'  ORDER BY title
---
    <tr>
      <th id=title_header class=<%= @sortVariable=='title' ? 'hilite' : '' %> > <%= link_to "Movie Title", movies_path(:sortVar => 'title', :ratings =>Hash[@ratings_to_show.map{|x| [x,1]}] ,) %></th>